
// Цикл на кожній ітерації пропонує через prompt ввести число більше 100 (але максимум 10 ітерацій циклу) . Якщо відвідувач ввів число менше ста – попросити ввести ще раз, і таке інше. Якщо користувач вводить більше ста, текст або цикл закінчує всі ітерації, то функція виводить в консоль останній введення користувача і завершує функцію.

function mainNumber() {
    // for (let i = 0; i <= 10 && (x = prompt("number less than 100:")) < 100; i++)
    for (let i = 0; i <= 9; i++) {
        let x = prompt("Enter number more than 100:");
        if (x === null || x < 100 || x === "") {
            prompt("number should be more than 100:")
            break
        }
        console.log(x)
    }
}
mainNumber();
